src/Catalogs/ar_LLMПровайдеры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ar_LLMПровайдеры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ar_Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ar_ТипПровайдера</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_BaseURL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_APIKeyИдентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_DefaultModel</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_ПоддерживаетToolCalls</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_Таймаут</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_ИспользоватьПрокси</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_Включён</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_MaxContext</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ar_LLMПровайдеры/Forms/ФормаЭлемента/Ext/Form/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, Александр Барабанов
//
// AgentRunner для 1С — свободное программное обеспечение: вы можете
// распространять и/или изменять его на условиях GNU Affero General Public
// License версии 3, опубликованной Free Software Foundation.
//
// Программа распространяется в надежде, что она будет полезной, но БЕЗ
// КАКИХ-ЛИБО ГАРАНТИЙ. Подробности — в файле LICENSE в корне репозитория
// и по ссылке: https://www.gnu.org/licenses/agpl-3.0.html
//
// Исходный код проекта:
// https://github.com/AI-1C-Expert/agentrunner
///////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////
// Форма элемента справочника ar_LLMПровайдеры - UI-14.
//
// Карточка LLM-провайдера: параметры подключения (тип, BaseURL, модель, лимиты),
// управление API-ключом («Установить ключ» / «Заменить ключ») и проверка
// работоспособности подключения («Тест соединения»). Значение API-ключа
// нигде не отображается и не передаётся на клиент - на форме показывается
// только UUID-идентификатор записи в БезопасноеХранилище и индикатор
// «Ключ задан» / «Ключ не задан» (SEC-01/SEC-03/UI-14).
////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Ветка автотеста: при программном открытии формы тестами пропускаем
	// инициализацию (паттерн catalog_form_on_create, как в ar_Агенты/UI-01).
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;

	// Значения по умолчанию для новой записи (Plan §3.8: таймаут 60 сек).
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если Объект.ar_Таймаут = 0 Тогда
			Объект.ar_Таймаут = 60;
		КонецЕсли;
	КонецЕсли;

	// Идентификатор ключа всегда только для просмотра - это UUID записи в
	// БезопасноеХранилище "для справки", не значение секрета (D7).
	Элементы.APIKeyИдентификатор.ТолькоПросмотр = Истина;

	ЗаполнитьСписокВыбораТипаПровайдера();

	Если НЕ ПравоДоступа("Изменение", Метаданные.Справочники.ar_LLMПровайдеры) Тогда
		ТолькоПросмотр = Истина;
	КонецЕсли;

	ОбновитьСостояниеКлючаНаСервере();
	ОбновитьДоступностьКнопокНаСервере();

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	ОбновитьСостояниеКлючаНаСервере();
	ОбновитьДоступностьКнопокНаСервере();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ar_УстановитьКлюч(Команда)

	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Сначала запишите провайдера';
			|en = 'Save provider first'"));
		Возврат;
	КонецЕсли;

	Оповещение = Новый ОписаниеОповещения("УстановитьКлючЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ar_ФормаВводаКлюча", Новый Структура, ЭтотОбъект, , , ,
		Оповещение, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры

&НаКлиенте
Процедура ar_ЗаменитьКлюч(Команда)

	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Сначала запишите провайдера';
			|en = 'Save provider first'"));
		Возврат;
	КонецЕсли;

	Оповещение = Новый ОписаниеОповещения("ЗаменитьКлючЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ar_ФормаВводаКлюча", Новый Структура, ЭтотОбъект, , , ,
		Оповещение, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры

&НаКлиенте
Процедура ar_ТестСоединения(Команда)

	Элементы.КнопкаТестСоединения.Доступность = Ложь;

	Попытка
		Результат = ВыполнитьТестСоединенияНаСервере();
	Исключение
		// ar_LLMТест.ПроверитьСоединение само перехватывает свои ошибки и
		// возвращает их в структуре результата; этот блок - подстраховка на
		// случай непредвиденного серверного сбоя (например, недоступность
		// БезопасноеХранилище). Текст ошибки платформы значения секрета
		// не содержит.
		Элементы.КнопкаТестСоединения.Доступность = Истина;
		ПоказатьПредупреждение(, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат;
	КонецПопытки;

	Элементы.КнопкаТестСоединения.Доступность = Истина;

	Если Результат.Успех Тогда
		ПоказатьОповещениеПользователя(Результат.Сообщение);
	Иначе
		ПоказатьПредупреждение(, Результат.Сообщение);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиОповещений

// Завершение диалога ввода ключа при первичной установке (UC-2).
//
// Параметры:
//  Результат               - Строка, Неопределено - введённое значение ключа
//                             ("ОбщаяФорма.ar_ФормаВводаКлюча") либо Неопределено
//                             при отмене диалога.
//  ДополнительныеПараметры - Произвольный - не используется (контекст ОписаниеОповещения).
//
&НаКлиенте
Процедура УстановитьКлючЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		// Отмена диалога - без побочных эффектов (D8).
		Возврат;
	КонецЕсли;

	Если ПустаяСтрока(Результат) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Ключ не может быть пустым';
			|en = 'Key cannot be empty'"));
		Возврат;
	КонецЕсли;

	УстановитьКлючНаСервере(Результат);

	ОбновитьСостояниеКлючаНаСервере();
	ОбновитьДоступностьКнопокНаСервере();

	ПоказатьОповещениеПользователя(НСтр("ru = 'Ключ сохранён'; en = 'Key saved'"));

КонецПроцедуры

// Завершение диалога ввода ключа при замене существующего (UC-3).
//
// Параметры:
//  Результат               - Строка, Неопределено - введённое значение ключа
//                             ("ОбщаяФорма.ar_ФормаВводаКлюча") либо Неопределено
//                             при отмене диалога.
//  ДополнительныеПараметры - Произвольный - не используется (контекст ОписаниеОповещения).
//
&НаКлиенте
Процедура ЗаменитьКлючЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		// Отмена диалога - без побочных эффектов (D8).
		Возврат;
	КонецЕсли;

	Если ПустаяСтрока(Результат) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Ключ не может быть пустым';
			|en = 'Key cannot be empty'"));
		Возврат;
	КонецЕсли;

	ЗаменитьКлючНаСервере(Результат);

	// UUID идентификатора ключа не меняется - повторный пересчёт индикатора
	// не требуется по существу, но вызывается для единообразия с UC-2 и
	// устойчивости к будущим изменениям ОбновитьСостояниеКлючаНаСервере.
	ОбновитьСостояниеКлючаНаСервере();

	ПоказатьОповещениеПользователя(НСтр("ru = 'Ключ заменён'; en = 'Key replaced'"));

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Сохраняет новый API-ключ провайдера (UC-2): генерирует UUID, кладёт значение
// в БезопасноеХранилище через ar_Secrets, записывает UUID в объект БД в
// транзакции. На входе ar_APIKeyИдентификатор гарантированно пуст -
// доступность кнопки «Установить ключ» проверяет это условие.
//
// Параметры:
//  НовыйКлюч - Строка - значение API-ключа (непустое, проверено на клиенте).
//
&НаСервере
Процедура УстановитьКлючНаСервере(Знач НовыйКлюч)

	НовыйUUID = ar_Утилиты.НовыйUUID();

	НачатьТранзакцию();
	Попытка
		// ar_Secrets сам поднимает привилегированный режим (контракт SEC-01) -
		// форма не управляет режимом напрямую.
		ar_Secrets.Сохранить(ar_Secrets.КлючПровайдера(НовыйUUID), НовыйКлюч);

		ОбъектБД = Объект.Ссылка.ПолучитьОбъект();
		ОбъектБД.ar_APIKeyИдентификатор = НовыйUUID;
		ОбъектБД.Записать();

		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		// Текст не содержит значения секрета - наружу уходит безопасное сообщение.
		ВызватьИсключение НСтр("ru = 'Не удалось сохранить API-ключ провайдера.';
			|en = 'Failed to save the provider API key.'");
	КонецПопытки;

	Объект.ar_APIKeyИдентификатор = НовыйUUID;

КонецПроцедуры

// Перезаписывает значение существующего API-ключа провайдера (UC-3): UUID не
// меняется, объект БД не перезаписывается. Фиксирует audit-событие ротации
// ключа (SEC-06).
//
// Параметры:
//  НовыйКлюч - Строка - новое значение API-ключа (непустое, проверено на клиенте).
//
&НаСервере
Процедура ЗаменитьКлючНаСервере(Знач НовыйКлюч)

	// Запись объекта здесь не выполняется (UUID не меняется), поэтому платформа
	// не проверяет права доступа автоматически - проверяем явно (в отличие от
	// УстановитьКлючНаСервере, где это делает Объект.Записать()).
	Если НЕ ПравоДоступа("Изменение", Метаданные.Справочники.ar_LLMПровайдеры) Тогда
		ВызватьИсключение НСтр("ru = 'Недостаточно прав для изменения API-ключа провайдера.';
			|en = 'Insufficient rights to change the provider API key.'");
	КонецЕсли;

	UUIDКлюча = Объект.ar_APIKeyИдентификатор;

	Попытка
		ar_Secrets.Сохранить(ar_Secrets.КлючПровайдера(UUIDКлюча), НовыйКлюч);
	Исключение
		// Текст не содержит значения секрета - наружу уходит безопасное сообщение.
		ВызватьИсключение НСтр("ru = 'Не удалось заменить API-ключ провайдера.';
			|en = 'Failed to replace the provider API key.'");
	КонецПопытки;

	ДанныеСобытия = Новый Структура;
	ДанныеСобытия.Вставить("target", "llm_provider.key");
	ДанныеСобытия.Вставить("provider", XMLСтрока(Объект.Ссылка));
	ar_AuditЗащищённыйРежим.ЗаписатьСобытиеПривилегированно("", "SecretRotated", ДанныеСобытия);

КонецПроцедуры

// Серверная обёртка теста соединения с провайдером (UC-4). Значение ключа
// никогда не покидает сервер - ar_LLMТест читает его из БезопасноеХранилище
// и маскирует все текстовые поля результата перед возвратом.
//
// Возвращаемое значение:
//  Структура { Успех, Сообщение, КодСостояния } - см. ar_LLMТест.ПроверитьСоединение.
//
&НаСервере
Функция ВыполнитьТестСоединенияНаСервере()

	Возврат ar_LLMТест.ПроверитьСоединение(Объект.Ссылка);

КонецФункции

// Пересчитывает реквизит формы КлючЗадан и текст индикатора по состоянию
// ar_APIKeyИдентификатор (UC-1, шаг 5).
//
&НаСервере
Процедура ОбновитьСостояниеКлючаНаСервере()

	КлючЗадан = НЕ ПустаяСтрока(Объект.ar_APIKeyИдентификатор);

	Если КлючЗадан Тогда
		Элементы.ИндикаторКлюча.Заголовок = НСтр("ru = 'Ключ задан';
			|en = 'Key is set'");
	Иначе
		Элементы.ИндикаторКлюча.Заголовок = НСтр("ru = 'Ключ не задан';
			|en = 'Key not set'");
	КонецЕсли;

КонецПроцедуры

// Обновляет видимость и доступность кнопок «Установить ключ» / «Заменить
// ключ» / «Тест соединения» (UC-1 шаг 6, граничные случаи спеки UI-14).
//
&НаСервере
Процедура ОбновитьДоступностьКнопокНаСервере()

	ОбъектЗаписан = ЗначениеЗаполнено(Объект.Ссылка);
	ЕстьПравоИзменения = ПравоДоступа("Изменение", Метаданные.Справочники.ar_LLMПровайдеры);

	Элементы.КнопкаУстановитьКлюч.Видимость = НЕ КлючЗадан;
	Элементы.КнопкаУстановитьКлюч.Доступность = ОбъектЗаписан И ЕстьПравоИзменения;

	Элементы.КнопкаЗаменитьКлюч.Видимость = КлючЗадан;
	Элементы.КнопкаЗаменитьКлюч.Доступность = ОбъектЗаписан И ЕстьПравоИзменения;

	Элементы.КнопкаТестСоединения.Доступность = ОбъектЗаписан И КлючЗадан;

КонецПроцедуры

// Ограничивает выбор типа провайдера тем же списком, что предлагает мастер
// настройки - список общий, см. ar_LLMДиспетчер.ТипыПровайдераДляВыбора().
//
// Если у уже записанного элемента проставлен тип вне списка (OpenAI, Anthropic,
// Mock - заведены до ограничения либо программно), он добавляется в конец
// списка выбора: иначе поле показывало бы пустое значение и первая же запись
// карточки молча затёрла бы рабочую настройку.
//
&НаСервере
Процедура ЗаполнитьСписокВыбораТипаПровайдера()

	СписокВыбора = Элементы.Тип.СписокВыбора;
	СписокВыбора.Очистить();

	ТекущийВСписке = НЕ ЗначениеЗаполнено(Объект.ar_Тип);

	Для Каждого ОписаниеТипа Из ar_LLMДиспетчер.ТипыПровайдераДляВыбора() Цикл
		СписокВыбора.Добавить(ОписаниеТипа.Ссылка, ОписаниеТипа.Подпись);
		Если Объект.ar_Тип = ОписаниеТипа.Ссылка Тогда
			ТекущийВСписке = Истина;
		КонецЕсли;
	КонецЦикла;

	Если НЕ ТекущийВСписке Тогда
		СписокВыбора.Добавить(Объект.ar_Тип, Строка(Объект.ar_Тип));
	КонецЕсли;

	Элементы.Тип.РежимВыбораИзСписка = Истина;

КонецПроцедуры

#КонецОбласти
